Revit 2027 API
ParameterSet.Contains Method
Tests for the existence of a parameter within the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual bool Contains(
	Parameter item
)
Public Overridable Function Contains (
	item As Parameter
) As Boolean
public:
virtual bool Contains(
	Parameter^ item
)
abstract Contains :
        item : Parameter -> bool
override Contains :
        item : Parameter -> bool
Parameters
item Parameter
The parameter to be searched for.
Return Value
Boolean
The Contains method returns True if the parameter is within the set, otherwise False.
See Also
Reference
ParameterSet Class
Autodesk.Revit.DB Namespace